### Contents

01 Import libraries and dataset

02 Data wrangling

03 Consistency checks

04 Combine dataframes

05 Export dataframe

### 01 Import libraries and dataset

In [2]:
# Import libraries

import pandas as pd
import numpy as np
import os

In [3]:
# Create path

path = r"C:\Users\cathe\OneDrive\Data Analysis\2 4 Instacart Basket Analysis\02 Data"

In [4]:
# Import customer dataset

df_cust = pd.read_csv(os.path.join(path, 'Original Data', 'customers.csv'), index_col = False)

In [5]:
# Import rest of prepared Instacart data

df_merge = pd.read_pickle(os.path.join(path, 'Prepared Data', 'ords_prods_merge_200225_2.pkl'))

### 02 Data wrangling

In [7]:
# Check column headings and first five lines

df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [17]:
# Rename more than one column at a time

df_cust.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'surname', 'STATE' : 'state'}, inplace = True)

In [15]:
df_cust.head()

,user_id,first_name,surname,Gender,state,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [17]:
# Rename columns consistently

df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [21]:
# Rename columns consistently

df_cust.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [23]:
# Rename columns consistently

df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [25]:
# Rename columns consistently

df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [27]:
# Rename columns consistently

df_cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [36]:
# Check if date_joined column holds any useful information

df_cust['date_joined'].value_counts()

date_joined
9/17/2018     213
2/10/2018     212
4/1/2019      211
9/21/2019     211
12/19/2017    210
             ...
9/1/2018      141
1/22/2018     140
11/24/2017    139
7/18/2019     138
8/6/2018      128
Name: count, Length: 1187, dtype: int64

It looked as if they might be all the same from the first 5 rows, but there is plenty of useful information here.

### 03 Consistency checks

In [30]:
# Check basic info

df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   first_name    194950 non-null  object
 2   surname       206209 non-null  object
 3   gender        206209 non-null  object
 4   state         206209 non-null  object
 5   age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

Missing values in first_name column only.  These will have to remain unknown.  First name is unlikely to be useful in analysis, although not impossible, so I shall not remove the column.

In [32]:
df_cust.describe()

             user_id            age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

Min, max, median and mean all look reasonable

In [40]:
# Check for mixed-type columns

for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird]) > 0:
        print (col)

first_name

In [43]:
# Change type of first_name to string

df_cust['first_name'] = df_cust['first_name'].astype('str')

In [45]:
# Check for mixed-type columns

for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].map(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird]) > 0:
        print (col)

In [47]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   first_name    206209 non-null  object
 2   surname       206209 non-null  object
 3   gender        206209 non-null  object
 4   state         206209 non-null  object
 5   age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

No missing first names, after all!  Just a mixed-type column confusion

In [50]:
# Check for duplicates

df_dups = df_cust[df_cust.duplicated()]

In [52]:
df_cust['user_id'][df_cust['user_id'].duplicated()]

Series([], Name: user_id, dtype: int64)

I'm hoping this means no duplicate user_ids

In [55]:
df_cust['user_id'].value_counts().value_counts()

count
1    206209
Name: count, dtype: int64

I'm quite confident this means every user_id is distinct.  Quite pleased with my code, too!

In [64]:
# Check gender column

df_cust['gender'].value_counts()

gender
Male      104067
Female    102142
Name: count, dtype: int64

No unexpected values

In [61]:
# Check state column

df_cust['state'].value_counts()

state
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

All consistent and no mis-spellings

In [68]:
# Check fam_status

df_cust['fam_status'].value_counts()

fam_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

No unexpected values

### 04 Combine dataframes

In [59]:
# Check df_cust

df_cust.head()

,user_id,first_name,surname,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [71]:
# Check merge dataframe

df_merge.head()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,av_item_spend,spend_level,median_days_since_prior_order,order_frequency
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Mid-range product,Regularly busy,Regular day,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,...,Mid-range product,Regularly busy,Regular day,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,...,Low-range product,Regularly busy,Regular day,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,...,Low-range product,Regularly busy,Regular day,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,...,Low-range product,Regularly busy,Regular day,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [73]:
# Check shape before proceeding

df_cust.shape

(206209, 10)

In [75]:
df_merge.shape

(32404161, 23)

In [77]:
# Merge dataframes using user_id as key

df_all = df_merge.merge(df_cust, on = 'user_id')

In [79]:
df_all.shape

(32404161, 32)

In [83]:
df_all.isnull().sum()

order_id                               0
user_id                                0
order_number                           0
order_day_of_week                      0
order_hour_of_day                      0
days_since_prior_order           2076054
product_id                             0
add_to_cart_order                      0
reordered                              0
product_name                           0
aisle_id                               0
department_id                          0
prices                                 0
price_range_loc                        0
busiest_day                            0
busiest_days                           0
busiest_period_of_day                  0
max_order                              0
loyalty_flag                           0
av_item_spend                          0
spend_level                            0
median_days_since_prior_order          5
order_frequency                        0
first_name                             0
surname                                0
gender                                 0
state                                  0
age                                    0
date_joined                            0
n_dependants                           0
fam_status                             0
income                                 0
dtype: int64

No unexpected missing values.  Merge successful!

### 05 Export dataframe

In [87]:
df_all.to_pickle(os.path.join(path, 'Prepared Data', 'orders_products_all.pkl'))